[
    {
        "id":"1",
        "title": "Accessibility and Inclusive Design Lab",
        "subtitle": "Dr. Richa Gupta, A - 406",
        "description": "Accessibility and Inclusive Design Lab aims at enabling independent living and empowering persons with special needs by making the world more inclusive and accessible. It attempts to address the challenges that hamper independent and easy access to educational resources as well as information that facilitates navigation (both indoor and outdoor). This lab levera ges the principles of human-centred design to create convenient and pleasant day-to-day experiences while solving problems particularly for persons with special needs. ",
        "buttonText": "Visit Website",
        "link":"https://aidlab.iiitd.edu.in/",
        "color": "#47638A",
        "logo": "aid.png",
        "Panelimage": "aidImg.svg",
        "txtColor":"#FFFFFF"
    },
    {
        "id":"2",
        "title": "Living Lab",
        "subtitle": "Dr. Grace Eden, A - 403",
        "description": "Understanding people’s attitudes towards and uses of technology is an essential aspect of successful design. Living Lab specializes in research that explores the interrelationships between people, society and technology. We conduct empirical research using a variety of qualitative methods to identify requirements, improve usefulness and usability and identify implications for how new technologies transform social life.",
        "buttonText": "Visit Website",
        "link":"https://livinglab.iiitd.edu.in/",
        "color": "#A4DAC3",
        "logo": "living.png",
        "Panelimage": "hci.svg",
        "txtColor":"#6F6F6F"
    },
    {
        "id":"3",
        "title": "Human - Machine Interaction Lab",
        "subtitle": "Dr. Jainendra Shukla, A - 413",
        "description": "At Human-Machine Interaction (HMI) lab, we investigate novel interaction mechanisms to empower human-machine cooperation. Located at Indraprastha Institute of Information Technology, Delhi, HMI Lab is an initiative founded by Dr. Jainendra Shukla. Our research at HMI lab lies at the intersection of Computer Science, Design, and Psychology. HMI lab provides a unique facility for talented individuals, including computer scientists, designers, and philosophers coming from Ph.D., master as well as undergraduate levels.",
        "buttonText": "Visit Website",
        "link":"https://hmi.iiitd.edu.in/",
        "color": "#8AC5EE",
        "logo": "hmi.png",
        "Panelimage": "hands.svg",
        "txtColor":"#FFFFFF"
    },
    
    {
        "id":"4",
        "title": "Weave Lab",
        "subtitle": "Dr. Aman Parnami, A - 405",
        "description": "At Weave Lab we weave interactivity into everyday objects and experiences. We envision as well as discover through critical observations new opportunities for human-computer interactions. Through our extensive research on material and technologies, we prototype manifestations of our ideas, which we then iteratively improve. Our applied research approach interweaves basic research with which we contribute to the advancement of the technologies we leverage.",
        "buttonText": "Visit Website",
        "link":"https://weave.iiitd.edu.in/",
        "color": "#F4B950",
        "logo": "weave.png",
        "Panelimage": "vr.svg",
        "txtColor":"#6F6F6F"
    },
    {
        "id":"5",
        "title": "MIDAS Lab",
        "subtitle": "Dr. Rajiv Ratn Shah, A - 409",
        "description": "MIDAS is a group of researchers at IIIT-Delhi who study, analyze, and build different multimedia systems for society leveraging multimodal information. MIDAS stands for Multimodal Digital Media Analysis Lab and it is founded by Dr. Rajiv Ratn Shah. Dr. Shah is an assistant professor in the Department of Computer Science and Engineering (jointly appointed with the Department of Human-Centered Design) at IIIT-Delhi.",
        "buttonText": "Visit Website",
        "link":"https://midas.iiitd.edu.in/",
        "color": "#F28900",
        "logo": "midas.png",
        "Panelimage": "midasImg.svg",
        "txtColor":"#FFFFFF"
    }
    
]